#include <bits/stdc++.h>
using namespace std;
//与&    1和1 -> 1 其余 0
//或|    0和0 -> 0 其余 1
//异或^  同为0 异为1

//位运算实现乘除法
//异或 == 不进位加法
//a + b == (a ^ b) + (a & b << 1);
//异或的逆运算 
//x ^ y = z;
//x = z ^ y;

//判断x是否为2的次方
//x > 0 && (x & (x - 1)) == 0;

//位运算乘除法
//x << 1 == x * 2;
//x >> 1 == x / 2;

//位运算实现数值交换
void swap(int &a,int &b){
    //a = 1010 ; b = 1100//异或同为 0,异为1
    a ^= b;//a = 1010 ^ 1100 => a = 0110
    b ^= a;//b = 1100 ^ 0110 => b = 1010
    a ^= b;//a = 0110 ^ 1010 => a = 1100
}
//改变正负
int change(int a){
    //首位是符号位
    //  a = 10001;
    //~ a = 01110;
    //  a = 01111;
    return ~ a + 1;//正码反码补码原理
}
//取绝对值
int abs(int a){
    //a >> 31  -> 0 或 1
    //~ a      -> 
    //首位1 -> 负; 0 -> 正
    //0 -> 1 -> a  正
    //1 -> 0 -> ~a 负 ( 改变正负~ a + 1 )
    return ~(a >> 31) ? a : ~ a + 1;
    //int 的字节有32位, ll 的字节有64位, 具体由编译器来定
} 
//计算二进制数中1的个数
int countone(int num){
    int count;
    while(num){//二进制数的1全部消去
        num = num & (num - 1);
        //末位为0向前借1
        //所以每次计算都会消去一个位值为1的位
        //或运算符 -> 1和1 -> 1
        count ++;
    }
    return count;
}

//更新二进制数某段数值
//给出两个32位的整数N和M,以及需要更改段落的下标i和j
//样例输入:N = (10000000000)2 M = (10101)2 i = 2 j = 6;
//   输出:N = (10001010100)2
class Solution {
public :
    int updateBits(int n,int m,int i,int j){
        //遍历循环i~j
        for(int pos = i;pos <= j;pos ++){
            //将n的第pos位设置为0
            //~(1 << pos)创建一个在pos位为0其它位为1的掩码
            //然后用与&运算符将第pos位设置为0
            n &= ~(1 << pos);
        }
        //将m左移i位,使m的低位对齐到n的第i位
        //然后使用按位或|运算符合并n和m
        //这样n的i ~ j位就被m的相应位的值替换
        return n | (m << i);
    }
}